In [3]:
import pandas as pd

# pd.Series(data,index,dtype): 1D

# pd.DataFarme(data,index,columns,dtype):2D

In [2]:
# Q. what is difference between Series and DF(DataFrame)

Docstring:      DF
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

SyntaxError: invalid syntax (2513145993.py, line 4)

# Create a DataFrame using different inputs

In [4]:
#List
pd.DataFrame([10,20,30,40,50])
#In DF columns are labelled

    0
0  10
1  20
2  30
3  40
4  50

In [5]:
pd.Series([10,20,30,40,50,])
# we dont have column option

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
#List of list
d=[[1,2,3],[4,5,6]]
# internal lista are now row
pd.DataFrame(d)

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
#using dict
d={'name':['Reva'],'age':[28],'Palce':['Karad'],'Sal':[60000]}
pd.DataFrame(d)
#here keys become a column name and value becomes columns entery

   name  age  Palce    Sal
0  Reva   28  Karad  60000

In [8]:
#add multiple entries
d={'name':['Radhika','Pooja','Sadiya','Prajwalita','sagar'],
   'age':[28,28,29,27,25],
   'Place':['Karad','kolhapur','dubai','kolhapur','sangali'],
   'sal':[50000,40000,65000,70000,50000]}
pd.DataFrame(d)

         name  age     Place    sal
0     Radhika   28     Karad  50000
1       Pooja   28  kolhapur  40000
2      Sadiya   29     dubai  65000
3  Prajwalita   27  kolhapur  70000
4       sagar   25   sangali  50000

In [9]:
# using numpy array
# PS: Create a DatafRame with random numbers 4x4
import numpy as np
n = np.random.random((4,4))
pd.DataFrame(n)

          0         1         2         3
0  0.846081  0.660818  0.890894  0.286688
1  0.433688  0.259616  0.155661  0.828474
2  0.159452  0.540026  0.822614  0.019048
3  0.874892  0.207453  0.115895  0.567412

In [10]:
#change index
pd.DataFrame(n,index=[101,102,103,104])

            0         1         2         3
101  0.846081  0.660818  0.890894  0.286688
102  0.433688  0.259616  0.155661  0.828474
103  0.159452  0.540026  0.822614  0.019048
104  0.874892  0.207453  0.115895  0.567412

In [11]:
#change column labels
pd.DataFrame(n,index=[101,102,103,104],columns=['A','B','C','D'])

            A         B         C         D
101  0.846081  0.660818  0.890894  0.286688
102  0.433688  0.259616  0.155661  0.828474
103  0.159452  0.540026  0.822614  0.019048
104  0.874892  0.207453  0.115895  0.567412

In [12]:
# using a series
s = pd.Series([1,2,3,4,5,6,7,8,9,10])
pd.DataFrame(s)

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [13]:
#use multiple of Series
s1=pd.Series([1,2,3,4])
s2=pd.Series(['A','B','C','D'])
s3=pd.Series([10,20,30,40])
pd.DataFrame({'val1':s1,'val2':s2,'val3':s3})

   val1 val2  val3
0     1    A    10
1     2    B    20
2     3    C    30
3     4    D    40

In [14]:
pd.DataFrame([s1,s2,s3])

    0   1   2   3
0   1   2   3   4
1   A   B   C   D
2  10  20  30  40

# Read Covid_variant.csv dataset

In [40]:
d=pd.read_csv(r'C:\Users\YugandharJagtap\Desktop\DATA SCIENTIST\DataScience\Pandas\DataFrame\DataFrame sir files\covid-variants.csv')
d

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3
...,...,...,...,...,...,...
100411,Zimbabwe,2021-11-01,Omicron,0,0.0,6
100412,Zimbabwe,2021-11-01,S:677H.Robin1,0,0.0,6
100413,Zimbabwe,2021-11-01,S:677P.Pelican,0,0.0,6
100414,Zimbabwe,2021-11-01,others,0,0.0,6
100415,Zimbabwe,2021-11-01,non_who,0,0.0,6

In [41]:
type(d)

pandas.core.frame.DataFrame

In [42]:
# how much data we have???
# rows and columns
d.shape

(100416, 6)

In [43]:
print('Total number of rows:',d.shape[0])
print('Total number of columns:',d.shape[1])

Total number of rows: 100416
Total number of columns: 6

# list out column names

In [44]:
d.describe()
# describe by default works on numeric columns

       num_sequences  perc_sequences  num_sequences_total
count  100416.000000   100416.000000        100416.000000
mean       72.171676        6.154355          1509.582457
std      1669.262169       21.898989          8445.291772
min         0.000000       -0.010000             1.000000
25%         0.000000        0.000000            12.000000
50%         0.000000        0.000000            59.000000
75%         0.000000        0.000000           394.000000
max    142280.000000      100.000000        146170.000000

# check data type of each column

In [45]:
d.dtypes

location                object
date                    object
variant                 object
num_sequences            int64
perc_sequences         float64
num_sequences_total      int64
dtype: object

# Apply describe function over object type columns

In [46]:
d.describe(include=object)

          location        date variant
count       100416      100416  100416
unique         121          45      24
top     Bangladesh  2021-01-25   Alpha
freq          1080        2688    4184

# if i want to check above options separatly

In [47]:
#count
d.location.count()

100416

In [48]:
#count of unique location
d.location.nunique()

121

In [49]:
# top location based on count
d.location.mode()

0        Bangladesh
1           Belgium
2            France
3            Mexico
4       Netherlands
5    United Kingdom
6     United States
Name: location, dtype: object

In [50]:
q = pd.Series(['ganesh','ramesh','ganesh','ramesh','ganesh'])
q.mode()

0    ganesh
dtype: object

In [51]:
# if i want to check frequency of each location then use value_counts()
d.location.value_counts()

Bangladesh        1080
Belgium           1080
United States     1080
United Kingdom    1080
France            1080
                  ...
Montenegro         384
Monaco             360
Fiji               336
Benin              336
Brunei             240
Name: location, Length: 121, dtype: int64